Repository: Seraf/JARVIS
Catalog: docs/locale/*/LC_MESSAGES/topics/plugins/management.po
Languages: fr

source: Plugin Management
fr: Gestion des Plugins

source: The plugin management is usefull to quickly manage plugins from Command Line Interface. It uses the same function than the web interface so it has the same behavior.
fr: La gestion de plugins est utile afin de gérer rapidement les plugins à partir de l"interface en ligne de commande. Cela utilise la même fonction que l'interface web est à donc le même comportement.

source: To list the functionnalities
fr: Lister les fonctionnalités

source: This option does not need to be called with a plugin name.
fr: Cette option n'a pas besoin d'être appellé par un nom de plugin.

source: This option will create a plugin in your plugins directory. It will ask some questions to auto-configure the plugin.
fr: Cette option va créer un plugin dans votre répertoire des plugins. Quelques questions vous seront demandés afin de configurer automatiquement le plugin.

source: This option will enable or disable a plugin. That means the plugin the plugin still exists in database and on filesystem but will not be loaded by the plugin manager.
fr: Cette option va activé ou désactivé un plugin. Cela signifie que le plugin est toujours présent dans la base de donnée and sur le système de fichier mais ne sera pas chargé par le gestionnaire de plugin.

source: This option allow you to specify that you are writing a plugin. It will not download it on Python Package Index but use the local plugin instead. It will not do anything on the filesystem but only on database. It is mainly used for install and uninstall function. When used with install, it will update all fields in database according your local plugin files. If you use uninstall with the dev mode, it will not delete the json file, only records in the database.
fr: Cette option vous permet de spécifier ce que vous écrivez dans l'extension. Cela ne le télécharge pas dans Python Package Index mais utilise plutôt l'extension local. Elle ne fait rien dans les fichiers système mais essentiellement dans la base de données. Utilisée principalement pour installer et désinstaller une fonction. Quand elle est utilisée pour l'installation, elle actualise tout les champs dans la base de données selon vos fichiers d'extension local. Si vous l'utilisez afin de désinstaller avec le mode développeur, elle ne désinstalle pas le fichier json, mais seulement les enregistrements de votre base de données.

source: This option will install a plugin. By default it download the package from Python Package Index then read the json file and install all components (rules, crons, intents, plugin configuration) in the database.
fr: Cette option installe l'extension. Par défaut elle télécharge le paquet depuis Python Package Index puis lis le fichier json et installe tout les composants (règles, crons, intension, configuration de l'extension) dans la base de données.

source: This option will uninstall a plugin. By default it will remove the package and all the files related to the plugin and remove entries related to the plugin in database.
fr: Cette option désinstalle l'extension. Par défaut cela supprime le paquet et tout les fichiers relatif à l'extension et supprime les entrées relatif à l'extension dans la base de données.

source: This option is not implemented yet.
fr: Cette option n'est pas encore implémentée.
