Repository: Seraf/JARVIS
Catalog: docs/locale/*/LC_MESSAGES/topics/index.po
Languages: fr

source: Introduction to L.I.S.A
fr: Introduction à L.I.S.A

source: The 30 second summary
fr: Le résumé en 30 secondes

source: L.I.S.A is:
fr: L.I.S.A c'est :

source: an intelligent system to help you in your daily life
fr: Un système intelligent afin de vous aider dans votre vie de tout les jours.

source: a framework to connect objects between them and expose a HTTP API
fr: Un framework qui interconnecte les objets entre-eux et expose l'API HTTP

source: It was developed in order to have a "J.A.R.V.I.S" like interface (Iron Man).
fr: Elle à été développée en ayant une interface similaire à "J.A.R.V.I.S" (Iron Man).

source: The name come from "Weird Science" TV Show. Two nerds try to create the perfect woman on their computer and one night she come to life. In France, this TV show is named "Code LISA".
fr: Le nom de L.I.S.A est tiré de "Weird Science" une série télévisée. Deux intellos essaie de créer la femme parfaite à l'aide de leur ordinateur et une nuit elle vient à la vie. En France, cette série télévisée est appelée "Code LISA".

source: That's why this project has this name.
fr: C'est pour cela que ce projet porte ce nom.

source: Building on proven technology
fr: S'appuyant sur une technologie approuvée.

source: L.I.S.A takes advantage of a number of technologies and techniques. The networking layer is built with the excellent `Twisted`_ networking library.
fr: L.I.S.A profite d'un certains nombres de technologies et techniques. La couche réseau est construite avec l’excellente bibliothèque réseau 'Twisted'.

source: L.I.S.A uses public keys for authentication to identify clients allowed to connect.
fr: L.I.S.A utilise des clés publiques lors de l'authentification de l'identité des clients autorisés à se connecter.

source: The Web interface is built on top of `Django`_ which is a web framework for python.
fr: L'interface web est construit au-dessus de 'Django' qui est un framework pour python.

source: L.I.S.A Community
fr: Communauté de L.I.S.A

source: Join L.I.S.A !
fr: Rejoigniez L.I.S.A !

source: There are many ways to participate in and communicate with the L.I.S.A community.
fr: Il existe une multitude de possibilités de participer au projet et communiquer avec la communauté de L.I.S.A.

source: L.I.S.A has an active IRC channel and a forum.
fr: L.I.S.A dispose d'un canal IRC actif et d'un forum.

source: Join the `L.I.S.A forum`_. It is the best place to ask questions about L.I.S.A and see whats going on with L.I.S.A development! It is open to new members.
fr: Rejoindre le 'forum L.I.S.A'_. C'est le meilleur endroit pour poser des questions concernant L.I.S.A et voir le développement de L.I.S.A ! C'est ouvert aux nouveaux membres.

source: The ``#lisa-project`` IRC channel is hosted on the popular `Freenode`__ network. You can use the `Freenode webchat client`__ right from your browser.
fr: Le canal IRC "#lisa-project" est hébergé par le populaire réseau 'Freenode'. Vous pouvez voir le 'client du tchat Freenode' à droite de votre navigateur.

source: Follow on Github
fr: Suivre sur Github

source: The L.I.S.A code is developed via Github. Follow L.I.S.A for constant updates on what is happening in L.I.S.A development:
fr: Le code de L.I.S.A est développé via Github. Suivre L.I.S.A pour les nombreuses mises à jours et voir le développement de L.I.S.A :

source: `L.I.S.A Server. <http://www.github.com/Seraf/L.I.S.A>`_
fr: 'Serveur L.I.S.A. <http://www.giyhub.com/Seraf/L.I.S.A>'

source: You can follow the roadmap on Waffle :
fr: Vous pouvez suivre la feuille de route sur Waffle :

source: `L.I.S.A Backlog. <https://waffle.io/seraf/lisa>`_
fr: 'Liste des tâches de L.I.S.A. <https://waffle.io/seraf/lisa>'

source: And check the build status on Travis :
fr: Et vérifiez le statut de construction sur Travis :

source: `L.I.S.A Build. <https://travis-ci.org/Seraf/LISA>`_
fr: 'Construction de L.I.S.A. <https://travis-ci.org/Seraf/LISA>'

source: Other community links
fr: Liens des autres communautés

source: `L.I.S.A Project. <http://www.lisa-project.net>`_
fr: 'Projet L.I.S.A. <http://www.lisa-project.net>'

source: Hack the Source
fr: Bidouiller le code

source: If you want to get involved with the development of source code or the documentation efforts, please review the :doc:`hacking section <development/hacking>`!
fr: Si vous voulez vous impliquer dans le développement du code source ou dans la documentation de L.I.S.A, veuillez regarder : :doc:'la section bidouillage <development/hacking>' !
