Repository: Seraf/JARVIS
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: fr

source: Frequently Asked Questions
fr: Foire Aux Questions

source: Is LISA open-source ?
fr: Est-ce que LISA est open-source ?

source: Yes. LISA is 100% open-source, including all APIs.
fr: Oui. LISA est 100% opensource, idem pour toutes les API.

source: And in the future, even if I create an enterprise with LISA, it will stay opensource and free.
fr: Et à l'avenir, mais si je crée une entreprise avec LISA, le projet restera à code ouvert et libre.

source: Can I fork it ?
fr: Puis je en faire un fork ?

source: Yes you can fork it if you want. Everything will be opensourced, even the "appstore". But of course, I encourage everyone to contribute instead of spreading smart people.
fr: Oui vous pouvez en faire un fork si vous voulez. Tout sera à code ouvert, même le "appstore". Mais évidemment j'encourage tout le monde à contribuer au projet au lieu de diluer nos talents.

source: Is LISA full local mode or does it need an Internet connection ?
fr: C'est LISA est en mode local ou faut-il une connexion internet ?

source: LISA is actually needing an Internet connection. I work on it to have something fully working even if your connection is broken.
fr: LISA à actuellement besoin d'une connexion internet cependant je travaille dessus afin de fournir quelque chose qui fonctionne même quand la connexion se coupe.

source: LISA need internet at least for his client (because speech recognition is online) and to use Wit Engine on the server side. Wit is also working on a local server for Wit. Once it will be available, it will be backported in LISA as soon as possible.
fr: LISA à au moins besoin d'internet pour son client (puisque la reconnaissance vocale est en ligne) et pour le moteur Wit sur la partie serveur. Wit fonctionne également sur un serveur local pour Wit. Une fois disponible, il sera retro-porté sur LISA le plus rapidement possible.

source: Which Speech Engine do you use ?
fr: Quel moteur de synthèse vocal utilisez vous ?

source: Even if it is one of the most important part of the project, I don't want to focus on it. The actual Linux Client use pocketsphinx to detect a keyword (the name of the bot). It's a trigger to launch the speech recognition by voice. LISA will listen and stream each chunk to Wit Speech API. It's a online webservice and they use many speech engine in backend to do the speech recognition. They plan to create free accoustic models and use (in the future) only opensource speech engine. They are partner of CMUSphinx.
fr: Même si elle une partie les plus importante du projet, je n'ai pas envie de me focaliser dessus. Le client Linux actuel utilise pocketsphinx afin de détecter keyword (le nom du robot). C'est le déclencheur pour lancer la reconnaissance vocale par voix. LISA écouter et diffuse chaque fragment sonore vers l'API Wit Speech. C'est un service web en ligne et ils utilisent plusieurs moteurs vocaux pour la reconnaissance vocale. Ils ont l'intention de créer des modèles acoustiques gratuits et utiliser (dans le futur) essentiellement un moteur vocal opensource. Ils sont partenaire de CMUSphinx.

source: Not convinced ? Don't want to see your voice go outside your home ?
fr: Pas convaincu ? Vous ne voulez pas voir votre voix aller en dehors de votre maison ?

source: Well, LISA was built to let the user choose his speech engine. You can create an irc bot client, a hangout bot, a jabber bot, a voice client which use Dragon Natural Speech, Windows Grammar, Android Speech Engine or whatever. The choice is yours, just send a sentence to LISA.
fr: Eh bien, LISA a été construit afin que l'utilisateur puisse choisir son moteur de reconnaissance vocale. Vous pouvez créer un robot client sur irc, un robot hangout, et jabber, le client voix peut utiliser Dragon Natural Speech, Windows Grammar, Android Speech Engine ou autres. C'est vous qui décider, il suffit d'envoyer son choix à LISA.

source: Don't forget that smaller is the device where is hosted the client, less will be the computing capacity to do speech recognition in local mode. But don't be worry, I want for myself something in local and working without internet connection.
fr: N'oubliez pas que le plus petit est le périphérique sur lequel est hébergé le client, Moins il y aura de capacité de calcul pour la reconnaissance en mode local. Mais pas de panique, je souhaite pour moi quelque chose en local et fonctionnent sans connexion internet.

source: Why LISA use mongodb as database ?
fr: Pourquoi LISA utilise mongodb comme base de données?

source: I am a DevOps, then when I code, I always think about how will it work in production. Is it scalable ? Mongodb let LISA to scale and support loss of a server. The database can be distribued accross your clients for example. The NoSQL technology allow developers to build plugins easily.
fr: Je suis un DevOps, donc quand je code, je reflechi toujours à comment mon code va fonctionner en production. Est il évolutif ? Mongodb permet à LISA d'être compatible et de s'adapter à la perte d'un serveur. La base de données peut être distribué à travers les clients par example. La technologie NoSQL permet aux développeurs de créer facilement des plugins.

source: As plugins and configuration are stored in the mongodb database, you can scale the LISA server with a load balancer.
fr: Vu que les plugins et la configuration est stocké dans la base mongodb, vous pouvez facilement mêttre à échelles le serveur LISA avec une répartition de charge.

source: The only problem is a lack of support for ARM. But there's a ticket opened on their JIRA issue tracker.
fr: Le seul problème est le manque de support de la plateforme ARM. Mais il y à un ticket d'ouvert sur leur traqeur de bogues JIRA.

source: What ports should I open on my firewall ?
fr: Quels ports dois-je ouvrir sur mon pare-feu ?

source: LISA use by default the port 10042 to communicate between client and server, and port 8000 for the webserver.
fr: LISA utilise par défaut le port 10042 pour communiquer entre le client et le serveur, et le port 8000 pour le serveur web.

source: Can I do Home Automation with this project ?
fr: Puis je faire de la domotique avec ce projet ?

source: Short answer : No. LISA allow you to create a bridge between your connected objects and your home automation box. LISA can also handle some "intelligency" to execute orders on your home automation box, but it won't replace an automation box.
fr: Réponse rapide: Non. LISA vous permet de créer un pont entre vos objets connectés et votre boitier domotique. LISA peut également gérer quelques "intelligence" à exécuter des ordres sur votre boite, mais cela ne replacera pas un boitier domotique.

source: Why LISA is written in Python ?
fr: Pourquoi LISA est écrit en Python ?

source: Firstly, I wanted to learn this language since a long. The code may be not perfect so don't hesit to send a patch. I love Python because there's a lot of API written in Python language and as LISA is a built to connect API between them it was logic to use a language easy to learn and easy to use.
fr: Premièrement, je cherche à apprendre ce langage depuis longtemps. Le code peut ne pas être parfait alors n'hésitez pas à envoyer un correctif. J'aime Python car beaucoup d'API sont écrit avec ce langage et comme LISA est construit afin de d'interconnecter les API, c'est donc logique langage facile d'apprentissage et facile à utiliser.
